FKDD_COPY_DIFF_3_2026-02-13/InformationRegisters/верс_ВерсииОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>верс_ВерсииОбъектов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВерсияОбъекта</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>АвторВерсии</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВерсии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСжато</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВерсииОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.верс_ТипыВерсийОбъекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПроигнорирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаТоваров</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УзелРИБ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

FKDD_COPY_DIFF_3_2026-02-13/CommonModules/верс_ВерсионированиеОбъектовПривилегированный/Ext/Module.bsl
// Записывает версию объекта в регистр сведений
Процедура ЗаписатьВерсиюОбъекта(знач Ссылка,
                                знач ЧислоВерсийОбъекта,
                                знач ХранилищеДанных) Экспорт  
 		МенеджерЗаписиВерсииОбъектов = РегистрыСведений.верс_ВерсииОбъектов.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписиВерсииОбъектов.Объект        	= Ссылка;
		МенеджерЗаписиВерсииОбъектов.ДатаВерсии    	= ТекущаяДата();
		МенеджерЗаписиВерсииОбъектов.ВерсияОбъекта 	= ХранилищеДанных;
		МенеджерЗаписиВерсииОбъектов.НомерВерсии	= ЧислоВерсийОбъекта + 1;
		МенеджерЗаписиВерсииОбъектов.АвторВерсии	= ПараметрыСеанса.Пользователь;
		МенеджерЗаписиВерсииОбъектов.УдалитьСжато 	= Истина;
		
		Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
			МенеджерЗаписиВерсииОбъектов.СуммаДокумента	= Ссылка.СуммаДокумента; 
			МенеджерЗаписиВерсииОбъектов.СуммаТоваров	= Ссылка.СуммаНоменклатурыДокумента; 
			МенеджерЗаписиВерсииОбъектов.СуммаРабот		= Ссылка.СуммаРаботДокумента; 
		ИначеЕсли НЕ Ссылка.Метаданные().Реквизиты.Найти("СуммаДокумента") = Неопределено Тогда	
			МенеджерЗаписиВерсииОбъектов.СуммаДокумента	= Ссылка.СуммаДокумента; 
		КонецЕсли;
		
		Если верс_ВерсионированиеОбъектов.ЕстьРИБ() Тогда
			МенеджерЗаписиВерсииОбъектов.УзелРИБ = ПланыОбмена.УдаленныеПодразделения.ЭтотУзел().Префикс;
		КонецЕсли;	
			
		МенеджерЗаписиВерсииОбъектов.Записать();  
	
КонецПроцедуры

// Возвращает количество версий объекта переданного по ссылке
Функция ПолучитьКоличествоВерсийОбъекта(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	| ВЫБРАТЬ ЕСТЬNULL(МАКСИМУМ(НомерВерсии), 0) КАК НомерВерсии
	| ИЗ РегистрСведений.верс_ВерсииОбъектов
	| ГДЕ Объект = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	НомерВерсии = Выборка.НомерВерсии;
	
	Возврат НомерВерсии;
	
КонецФункции

Процедура ВыполнитьСжатиеВерсийОбъектовПоРегламентномуЗаданию() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "ВЫБРАТЬ Объект,  НомерВерсии, ВерсияОбъекта 
	                | ИЗ РегистрСведений.верс_ВерсииОбъектов 
	                | ГДЕ УдалитьСжато = Ложь";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ДвоичныеДанные  = Выборка.ВерсияОбъекта.Получить();
		ХранилищеДанных = Новый ХранилищеЗначения(ДвоичныеДанные, Новый СжатиеДанных(9));
		
		МенеджерЗаписиВерсииОбъектов = РегистрыСведений.верс_ВерсииОбъектов.СоздатьМенеджерЗаписи();
		
		МенеджерЗаписиВерсииОбъектов.Объект        = Выборка.Объект;
		МенеджерЗаписиВерсииОбъектов.НомерВерсии   = Выборка.НомерВерсии;
		
		МенеджерЗаписиВерсииОбъектов.Прочитать();
		МенеджерЗаписиВерсииОбъектов.ВерсияОбъекта = ХранилищеДанных;
		МенеджерЗаписиВерсииОбъектов.УдалитьСжато  = Истина;
		МенеджерЗаписиВерсииОбъектов.Записать();
		
	КонецЦикла;
	
КонецПроцедуры
